package common

import (
	"testing"
	"time"
)

func TestCreateExcelFile(t *testing.T) {

	var (
		pathFile = CreatePathFile("excels",time.Now().Format("20060102"))+"/"+time.Now().Format("20060102150405")+".xlsx"
		sheet = "Sheet1"
		data = [][]interface{}{
            {"ชื่อ-สกุล", "เบอร์โทร", "ทะเบียนรถ", "เลขที่ใบรับประกัน", "ร้านค้าที่ซื้อ", "วันที่ซื้อ", "ประเภทสินค้า", "รายการสินค้า", "จำนวน", "วันที่หมดรับประกันโครงสร้าง", "วันที่หมดรับประกันสี", "วันที่หมดรับประกันคุณภาพ", "หมดรับประกันระยะ", "แคมเปญ", "จำนวน"},
			{"เอกณรินทร์ จันทร์เจริญ","918183147","ญย8781 กทม.","2403000066","ห้างหุ้นส่วนจำกัด ทรัพย์สมบูรณ์ ยางยนต์","15/3/2024  16:48:45","tire","COSMIS","4","15/3/2030","15/9/2024","15/3/2026","121284","รับประกัน บาด บวม แตก ตำ",},
        }
	)
	CreateExcel(pathFile,sheet,data)
}

